name: "content_tagging"
backend: "python"
input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ 1, -1 ]
  }
]
output [
{
    name: "CONTENT"
    data_type: TYPE_STRING
    dims: [ 1, -1]
}
]

version_policy: { specific: { versions: [1]}}