name: "preprocess"
backend: "python"
input [
{
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ 1, -1 ]
}
]
output [
{
    name: "IMAGE_FOR_COLOR_TAGGING"
    data_type: TYPE_UINT8
    dims: [ 1, -1, 3 ]
},
{
    name: "IMAGE_FOR_CONTENT_TAGGING"
    data_type: TYPE_FP32
    dims: [ 1, 3,224,224]
}
]

instance_group [{ kind: KIND_CPU }]